#Данная программа находит все простые числа от 2 до числа, которое вводит пользователь
n = input("Введите целое число: ") #Ввод числа пользователем
if not n.isdigit(): #Проверка на корректный ввод числа
    print("Вы должны ввести число")
else:
    n = int(n)
    # Создаем список от 0 до n
    b = [0] * (n + 1)
    
    # Заполняем список числами от 2 до n
    for i in range(2, n + 1):
        b[i] = int(i)
    
    print("Начальный список:", list(b)) #Выводим начальный списко всех чисел от 0 до введенного числа
    
    p = 2
    while p**2 <= n: 
        if b[p] != 0: # Если число не зачеркнуто
            # Начинаем зачеркивать кратные p, начиная с p*p
            for i in range(p * p, n + 1, p):
                b[i] = 0
        p += 1
        
    # Собираем итоговый список без нулей
    # Оставляем только те элементы, которые не равны 0 и больше 1 (или просто не равны 0, так как 0 и 1 у нас и так 0)
    primes = [x for x in b if x != 0]
    #Выводим итоговый набор простых чисел
    print("Итоговый список простых чисел:", primes)
